# Переменные

# (Версия 1)

Курс = 'Python'
Всего_задач = 12
Затрачено_часов = 1.5
Среднее_время_выполнения = Затрачено_часов/Всего_задач
print('Курс: '+(Курс)+', всего задач: '+str(Всего_задач)+', затрачено часов: '+str(Затрачено_часов)+', среднее время выполнения: '+str(Среднее_время_выполнения)+' часа.')


# Версия 2

Курс = 'Python'
Всего_задач = 12
Затрачено_часов = 1.5
Среднее_время_выполнения = Затрачено_часов/Всего_задач
print(f'Курс: {Курс}, всего задач: {Всего_задач}, затрачено часов: {Затрачено_часов}, среднее время выполнения: {Среднее_время_выполнения} часа.')